# -*- coding: utf-8 -*-
# SPDX-License-Identifier: Apache-2.0
from flask import render_template

from se_models import SummerSchool

schools = {
    2021: {
        "name": "Р›РµС‚РЅСЏСЏ С€РєРѕР»Р° 2021",
        "full_name": "Р›РµС‚РЅСЏСЏ РїСЂРѕРµРєС‚РЅР°СЏ РѕРЅР»Р°Р№РЅ-С€РєРѕР»Р° РїСЂРѕРіСЂР°РјРјРёСЂРѕРІР°РЅРёСЏ РґР»СЏ РѕР±СѓС‡Р°СЋС‰РёС…СЃСЏ РЎРџР±Р“РЈ (<strong>2021</strong>, РѕРЅР»Р°Р№РЅ).",
        "description": "РЁРєРѕР»Р° РїСЂРѕРІРѕРґРёР»Р°СЃСЊ СЃ <strong>12-РіРѕ РёСЋР»СЏ РїРѕ 6-Рµ Р°РІРіСѓСЃС‚Р°</strong>. 12 РёСЋР»СЏ РІ 12:00 РїСЂРѕС€Р»Рѕ РѕС‚РєСЂС‹С‚РёРµ С€РєРѕР»С‹ Рё РїСЂРµР·РµРЅС‚Р°С†РёСЏ РїСЂРѕРµРєС‚РѕРІ. 6 Р°РІРіСѓСЃС‚Р° Р±С‹Р»Рё РїСЂРѕРІРµРґРµРЅС‹ РїСЂРµР·РµРЅС‚Р°С†РёРё СЂРµР·СѓР»СЊС‚Р°С‚РѕРІ РїСЂРѕРµРєС‚РѕРІ, РїРѕРґРІРµРґРµРЅРёРµ РёС‚РѕРіРѕРІ Рё Р·Р°РєСЂС‹С‚РёРµ С€РєРѕР»С‹.",
        "href": "summer_school_2021",
    },
    2022: {
        "name": "Р›РµС‚РЅСЏСЏ С€РєРѕР»Р° 2022",
        "full_name": "Р›РµС‚РЅСЏСЏ РїСЂРѕРµРєС‚РЅР°СЏ РѕРЅР»Р°Р№РЅ-С€РєРѕР»Р° РїСЂРѕРіСЂР°РјРјРёСЂРѕРІР°РЅРёСЏ РґР»СЏ РѕР±СѓС‡Р°СЋС‰РёС…СЃСЏ РЎРџР±Р“РЈ (<strong>2022</strong>, РѕРЅР»Р°Р№РЅ).",
        "description": "РЁРєРѕР»Р° РїСЂРѕРІРѕРґРёР»Р°СЃСЊ СЃ <strong>4 РїРѕ 30 РёСЋР»СЏ</strong>. 4 РёСЋР»СЏ РІ 12:00 РїСЂРѕС€Р»Рѕ РѕС‚РєСЂС‹С‚РёРµ С€РєРѕР»С‹ Рё РїСЂРµР·РµРЅС‚Р°С†РёСЏ РїСЂРѕРµРєС‚РѕРІ. 30 РёСЋР»СЏ Р±С‹Р»Рё РїСЂРѕРІРµРґРµРЅС‹ РїСЂРµР·РµРЅС‚Р°С†РёРё СЂРµР·СѓР»СЊС‚Р°С‚РѕРІ РїСЂРѕРµРєС‚РѕРІ, РїРѕРґРІРµРґРµРЅРёРµ РёС‚РѕРіРѕРІ Рё Р·Р°РєСЂС‹С‚РёРµ С€РєРѕР»С‹.",
        "href": "summer_school_2022",
    },
    2024: {
        "name": "Р›РµС‚РЅСЏСЏ С€РєРѕР»Р° 2024",
        "full_name": "Р›РµС‚РЅСЏСЏ РїСЂРѕРµРєС‚РЅР°СЏ РѕРЅР»Р°Р№РЅ-С€РєРѕР»Р° РїСЂРѕРіСЂР°РјРјРёСЂРѕРІР°РЅРёСЏ РґР»СЏ РѕР±СѓС‡Р°СЋС‰РёС…СЃСЏ РЎРџР±Р“РЈ (<strong>2024</strong>, РѕРЅР»Р°Р№РЅ).",
        "description": "РЁРєРѕР»Р° РїСЂРѕРІРѕРґРёР»Р°СЃСЊ СЃ <strong>8 РёСЋР»СЏ РїРѕ 3 Р°РІРіСѓСЃС‚Р°</strong>. 8 РёСЋР»СЏ РІ 12:00 РїСЂРѕС€Р»Рѕ РѕС‚РєСЂС‹С‚РёРµ С€РєРѕР»С‹ Рё РїСЂРµР·РµРЅС‚Р°С†РёСЏ РїСЂРѕРµРєС‚РѕРІ. 2 Р°РІРіСѓСЃС‚Р° Р±С‹Р»Рё РїСЂРѕРІРµРґРµРЅС‹ РїСЂРµР·РµРЅС‚Р°С†РёРё СЂРµР·СѓР»СЊС‚Р°С‚РѕРІ РїСЂРѕРµРєС‚РѕРІ, РїРѕРґРІРµРґРµРЅРёРµ РёС‚РѕРіРѕРІ Рё Р·Р°РєСЂС‹С‚РёРµ С€РєРѕР»С‹.",
        "href": "summer_school_2024",
    },
    2026: {
        "name": "Р›РµС‚РЅСЏСЏ С€РєРѕР»Р° 2026",
        "full_name": "Р›РµС‚РЅСЏСЏ РїСЂРѕРµРєС‚РЅР°СЏ С€РєРѕР»Р° РїСЂРѕРіСЂР°РјРјРёСЂРѕРІР°РЅРёСЏ РґР»СЏ РѕР±СѓС‡Р°СЋС‰РёС…СЃСЏ РЎРџР±Р“РЈ 2026",
        "description": "<p>Р›РµС‚РЅСЏСЏ С€РєРѕР»Р° РїСЂРѕР№РґРµС‚ СЃ 6 РёСЋР»СЏ РїРѕ 1 Р°РІРіСѓСЃС‚Р°. РўРѕСЂР¶РµСЃС‚РІРµРЅРЅРѕРµ РѕС‚РєСЂС‹С‚РёРµ СЃРѕСЃС‚РѕРёС‚СЃСЏ 6 РёСЋР»СЏ РІ 14:00. РќР° РѕС‚РєСЂС‹С‚РёРё РІС‹СЃС‚СѓРїСЏС‚ РєСѓСЂР°С‚РѕСЂС‹ РїСЂРѕРµРєС‚РѕРІ, РєРѕС‚РѕСЂС‹Рµ СЂР°СЃСЃРєР°Р¶СѓС‚ Рѕ РїСЂРµРґСЃС‚РѕСЏС‰РµР№ СЂР°Р±РѕС‚Рµ Рё РїРѕРґРµР»СЏС‚СЃСЏ РІР°Р¶РЅРѕР№ РѕСЂРіР°РЅРёР·Р°С†РёРѕРЅРЅРѕР№ РёРЅС„РѕСЂРјР°С†РёРµР№.</p><p>Р’ СЌС‚РѕРј РіРѕРґСѓ СѓС‡Р°СЃС‚РЅРёРєР°Рј Р›РµС‚РЅРµР№ С€РєРѕР»С‹ РІРїРµСЂРІС‹Рµ Р±СѓРґСѓС‚ РґРѕСЃС‚СѓРїРЅС‹ РґРІР° С‚СЂРµРєР°: РїСЂРѕРµРєС‚РЅС‹Р№ Рё РѕР±СЂР°Р·РѕРІР°С‚РµР»СЊРЅС‹Р№. РЈС‡Р°СЃС‚РЅРёРєРё СЃРјРѕРіСѓС‚ РІС‹Р±СЂР°С‚СЊ РЅР°РёР±РѕР»РµРµ РїРѕРґС…РѕРґСЏС‰РёР№ С„РѕСЂРјР°С‚, Р° С‚Р°РєР¶Рµ РїРѕСЃРµС‚РёС‚СЊ РѕС‚РєСЂС‹С‚С‹Рµ Р»РµРєС†РёРё РїСЂРµРґСЃС‚Р°РІРёС‚РµР»РµР№ РРў-РєРѕРјРїР°РЅРёР№ Рё РёСЃСЃР»РµРґРѕРІР°С‚РµР»СЊСЃРєРёС… РєРѕР»Р»РµРєС‚РёРІРѕРІ.</p><p>Р›РµС‚РЅСЏСЏ С€РєРѕР»Р° РїСЂРѕРІРѕРґРёС‚СЃСЏ СЃ РїСЂРёРІР»РµС‡РµРЅРёРµРј РїСЂРѕС„РµСЃСЃРѕСЂСЃРєРѕ-РїСЂРµРїРѕРґР°РІР°С‚РµР»СЊСЃРєРѕРіРѕ СЃРѕСЃС‚Р°РІР° РЎРџР±Р“РЈ, РїСЂРё РїРѕРґРґРµСЂР¶РєРµ РёРЅРґСѓСЃС‚СЂРёР°Р»СЊРЅС‹С… РїР°СЂС‚РЅРµСЂРѕРІ Рё РђСЃСЃРѕС†РёР°С†РёРё РЅРµР·Р°РІРёСЃРёРјС‹С… СЂР°Р·СЂР°Р±РѕС‚С‡РёРєРѕРІ РїСЂРѕРіСЂР°РјРјРЅРѕРіРѕ РѕР±РµСЃРїРµС‡РµРЅРёСЏ Рё РІС‹С‡РёСЃР»РёС‚РµР»СЊРЅРѕР№ С‚РµС…РЅРёРєРё РЅР° РѕСЃРЅРѕРІРµ Р°СЂС…РёС‚РµРєС‚СѓСЂС‹ RISC-V (В«РђР»СЊСЏРЅСЃ RISC-VВ»).</p>",
        "href": "summer_school_2026",
    },
}


def create_summer_school_view(year: int):
    def summer_school():
        projects = SummerSchool.query.filter_by(year=year).all()

        return render_template("summer_school.html", projects=projects, school=schools[year])

    # flask makes function identification by name
    summer_school.__name__ = "summer_school_" + str(year)

    return summer_school


def summer_school_list():
    return render_template("summer_school_list.html", schools=schools)
