# -*- coding: utf-8 -*-
# SPDX-License-Identifier: Apache-2.0

from flask_wtf import FlaskForm
from flask_wtf.file import FileField
from markupsafe import Markup
from wtforms import RadioField, StringField
from wtforms.widgets import TextArea


class ReviewForm(FlaskForm):
    o1_label_5 = Markup(
        "<strong>РћС‚Р»РёС‡РЅРѕ (5)</strong>: РїРѕ СЃРІРѕРµРјСѓ СЃРѕРґРµСЂР¶Р°РЅРёСЋ Рё РѕС„РѕСЂРјР»РµРЅРёСЋ СЂР°Р±РѕС‚Р° СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓРµС‚ РІСЃРµРј РїСЂРµРґСЉСЏРІР»РµРЅРЅС‹Рј С‚СЂРµР±РѕРІР°РЅРёСЏРј"
    )
    o1_label_4 = Markup(
        "<strong>РћС‡РµРЅСЊ С…РѕСЂРѕС€Рѕ (4)</strong>: Р»СѓС‡С€Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј РѕС‚Р»РёС‡РЅРѕ"
    )
    o1_label_3 = Markup(
        "<strong>РҐРѕСЂРѕС€Рѕ (3)</strong>: РїРѕ СЃРІРѕРµРјСѓ СЃРѕРґРµСЂР¶Р°РЅРёСЋ Рё РѕС„РѕСЂРјР»РµРЅРёСЋ СЂР°Р±РѕС‚Р° СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓРµС‚ Р±РѕР»СЊС€РёРЅСЃС‚РІСѓ РїСЂРµРґСЉСЏРІР»РµРЅРЅС‹С… С‚СЂРµР±РѕРІР°РЅРёР№, РёР»Рё РёРјРµРµС‚СЃСЏ СЂСЏРґ РЅРµС‚РѕС‡РЅРѕСЃС‚РµР№, РєРѕС‚РѕСЂС‹Рµ РЅРµ РјРµС€Р°СЋС‚ РѕР±С‰РµРјСѓ РІРѕСЃРїСЂРёСЏС‚РёСЋ СЂР°Р±РѕС‚С‹"
    )
    o1_label_2 = Markup(
        "<strong>РЈРґРѕРІР»РµС‚РІРѕСЂРёС‚РµР»СЊРЅРѕ (2)</strong>: Р»СѓС‡С€Рµ, С‡РµРј РґРѕСЃС‚Р°С‚РѕС‡РЅРѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ"
    )
    o1_label_1 = Markup(
        "<strong>Р”РѕСЃС‚Р°С‚РѕС‡РЅРѕ (1)</strong>: РџРѕ СЃРІРѕРµРјСѓ СЃРѕРґРµСЂР¶Р°РЅРёСЋ Рё РѕС„РѕСЂРјР»РµРЅРёСЋ СЂР°Р±РѕС‚Р° СЏРІРЅРѕ РЅР°СЂСѓС€Р°РµС‚ РЅРµ Р±РѕР»РµРµ С‚СЂС‘С… РїСЂРµРґСЉСЏРІР»РµРЅРЅС‹С… С‚СЂРµР±РѕРІР°РЅРёР№"
    )
    o1_label_0 = Markup(
        "<strong>РџР»РѕС…Рѕ (0)</strong>: С…СѓР¶Рµ, С‡РµРј В«РґРѕСЃС‚Р°С‚РѕС‡РЅРѕВ»"
    )

    review_o1_radio_switcher = RadioField(
        "ReviewO1Form",
        choices=[
            ("5", o1_label_5),
            ("4", o1_label_4),
            ("3", o1_label_3),
            ("2", o1_label_2),
            ("1", o1_label_1),
            ("0", o1_label_0),
        ],
    )

    review_o1_comment = StringField(
        "review_o1_comment",
        description="РўСѓС‚ РїРµСЂРµС‡РёСЃР»РёС‚Рµ Р·Р°РјРµС‡Р°РЅРёСЏ Рє СЂР°Р±РѕС‚Рµ РїРѕ СЌС‚РѕРјСѓ РєСЂРёС‚РµСЂРёСЋ",
        widget=TextArea(),
    )

    o2_label_5 = Markup(
        "<strong>РћС‚Р»РёС‡РЅРѕ (5)</strong>: РІ СЂР°Р±РѕС‚Рµ РѕРїРёСЃР°РЅ РєРѕРЅС‚РµРєСЃС‚ СЂРµС€Р°РµРјРѕР№ Р·Р°РґР°С‡Рё, РїСЂРёСЃСѓС‚СЃС‚РІСѓРµС‚ РѕР±Р·РѕСЂ Р°РЅР°Р»РѕРіРѕРІ, РїСЂРµРґС€РµСЃС‚РІСѓСЋС‰РёС… СЂР°Р±РѕС‚ Рё РёСЃРїРѕР»СЊР·СѓРµРјС‹С… РёРЅСЃС‚СЂСѓРјРµРЅС‚РѕРІ (РµСЃР»Рё СЌС‚Рѕ СѓРјРµСЃС‚РЅРѕ), СЃСѓС‰РµСЃС‚РІРµРЅРЅС‹Рµ СѓС‚РІРµСЂР¶РґРµРЅРёСЏ СЂР°Р±РѕС‚С‹ РїРѕРґС‚РІРµСЂР¶РґРµРЅС‹ СЃСЃС‹Р»РєР°РјРё РЅР° РёСЃС‚РѕС‡РЅРёРєРё, СЃРѕСЃС‚Р°РІР»РµРЅР° Р±РёР±Р»РёРѕРіСЂР°С„РёСЏ РїРѕ С‚РµРјРµ СЂР°Р±РѕС‚С‹"
    )
    o2_label_4 = Markup(
        "<strong>РћС‡РµРЅСЊ С…РѕСЂРѕС€Рѕ (4)</strong>: Р»СѓС‡С€Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј РѕС‚Р»РёС‡РЅРѕ"
    )
    o2_label_3 = Markup(
        "<strong>РҐРѕСЂРѕС€Рѕ (3)</strong>: РїСЂРѕРґРµРјРѕРЅСЃС‚СЂРёСЂРѕРІР°РЅС‹ РЅР°РІС‹РєРё СЂР°Р±РѕС‚С‹ СЃ РёСЃС‚РѕС‡РЅРёРєР°РјРё, РЅРѕ СѓРїСѓС‰РµРЅС‹ РЅРµРєРѕС‚РѕСЂС‹Рµ РІР°Р¶РЅС‹Рµ СЂРµР·СѓР»СЊС‚Р°С‚С‹, РЅРµ РІСЃРµ СЃСѓС‰РµСЃС‚РІРµРЅРЅС‹Рµ СѓС‚РІРµСЂР¶РґРµРЅРёСЏ СЂР°Р±РѕС‚С‹ РїРѕРґС‚РІРµСЂР¶РґРµРЅС‹ СЃСЃС‹Р»РєР°РјРё РЅР° РёСЃС‚РѕС‡РЅРёРєРё. РЎРѕСЃС‚Р°РІР»РµРЅР° Р±РёР±Р»РёРѕРіСЂР°С„РёСЏ РїРѕ С‚РµРјРµ СЂР°Р±РѕС‚С‹"
    )
    o2_label_2 = Markup(
        "<strong>РЈРґРѕРІР»РµС‚РІРѕСЂРёС‚РµР»СЊРЅРѕ (2)</strong>: Р»СѓС‡С€Рµ, С‡РµРј РґРѕСЃС‚Р°С‚РѕС‡РЅРѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ"
    )
    o2_label_1 = Markup(
        "<strong>Р”РѕСЃС‚Р°С‚РѕС‡РЅРѕ (1)</strong>: РІ СЂР°Р±РѕС‚Рµ РЅРµ РѕРїРёСЃР°РЅ РєРѕРЅС‚РµРєСЃС‚ СЂРµС€Р°РµРјРѕР№ Р·Р°РґР°С‡Рё, Р»РёР±Рѕ РїРѕР»РЅРѕСЃС‚СЊСЋ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚ РѕР±Р·РѕСЂ Р°РЅР°Р»РѕРіРѕРІ, РїСЂРµРґС€РµСЃС‚РІСѓСЋС‰РёС… СЂР°Р±РѕС‚ Р»РёР±Рѕ РёСЃРїРѕР»СЊР·СѓРµРјС‹С… РёРЅСЃС‚СЂСѓРјРµРЅС‚РѕРІ (РµСЃР»Рё СЌС‚Рѕ СѓРјРµСЃС‚РЅРѕ), РїСЂРёСЃСѓС‚СЃС‚РІСѓСЋС‚ СЃСѓР±СЉРµРєС‚РёРІРЅС‹Рµ РѕС†РµРЅРѕС‡РЅС‹Рµ СЃСѓР¶РґРµРЅРёСЏ РёР»Рё РјРЅРѕРіРѕС‡РёСЃР»РµРЅРЅС‹Рµ РЅРµРїРѕРґС‚РІРµСЂР¶РґС‘РЅРЅС‹Рµ СѓС‚РІРµСЂР¶РґРµРЅРёСЏ"
    )
    o2_label_0 = Markup(
        "<strong>РџР»РѕС…Рѕ (0)</strong>: РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚ Р»РёС‚РµСЂР°С‚СѓСЂРЅС‹Р№ РѕР±Р·РѕСЂ, Р±РёР±Р»РёРѕРіСЂР°С„РёСЏ РїРѕ С‚РµРјРµ СЂР°Р±РѕС‚С‹"
    )

    review_o2_radio_switcher = RadioField(
        "ReviewO2Form",
        choices=[
            ("5", o2_label_5),
            ("4", o2_label_4),
            ("3", o2_label_3),
            ("2", o2_label_2),
            ("1", o2_label_1),
            ("0", o2_label_0),
        ],
    )

    review_o2_comment = StringField(
        "review_o2_comment",
        description="РўСѓС‚ РїРµСЂРµС‡РёСЃР»РёС‚Рµ Р·Р°РјРµС‡Р°РЅРёСЏ Рє РѕР±Р·РѕСЂСѓ",
        widget=TextArea(),
    )

    t1_label_5 = Markup(
        "<strong>РћС‚Р»РёС‡РЅРѕ (5)</strong>: РІ СЂР°Р±РѕС‚Рµ РїСЂРёРІРµРґРµРЅС‹ РёСЃС‡РµСЂРїС‹РІР°СЋС‰РёРµ Р°СЂРіСѓРјРµРЅС‚С‹ РїСЂРёРЅСЏС‚С‹С… СЂРµС€РµРЅРёР№"
    )
    t1_label_4 = Markup(
        "<strong>РћС‡РµРЅСЊ С…РѕСЂРѕС€Рѕ (4)</strong>: Р»СѓС‡С€Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј РѕС‚Р»РёС‡РЅРѕ"
    )
    t1_label_3 = Markup(
        "<strong>РҐРѕСЂРѕС€Рѕ (3)</strong>: РІ СЂР°Р±РѕС‚Рµ РїСЂРёРІРµРґРµРЅС‹ РјРµС‚РѕРґРѕР»РѕРіРёС‡РµСЃРєРё РІРµСЂРЅС‹Рµ Р°СЂРіСѓРјРµРЅС‚С‹ РїСЂРёРЅСЏС‚С‹С… СЂРµС€РµРЅРёР№. Р”РѕРїРѕР»РЅРёС‚РµР»СЊРЅС‹Рµ Р°СЂРіСѓРјРµРЅС‚С‹ РјРѕРіСѓС‚ СѓР»СѓС‡С€РёС‚СЊ СЂР°Р±РѕС‚Сѓ"
    )
    t1_label_2 = Markup(
        "<strong>РЈРґРѕРІР»РµС‚РІРѕСЂРёС‚РµР»СЊРЅРѕ (2)</strong>: Р»СѓС‡С€Рµ, С‡РµРј РґРѕСЃС‚Р°С‚РѕС‡РЅРѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ"
    )
    t1_label_1 = Markup(
        "<strong>Р”РѕСЃС‚Р°С‚РѕС‡РЅРѕ (1)</strong>: РІ СЂР°Р±РѕС‚Рµ РµСЃС‚СЊ СЃР»Р°Р±Р°СЏ Р°СЂРіСѓРјРµРЅС‚Р°С†РёСЏ РїСЂРёРЅСЏС‚С‹С… СЂРµС€РµРЅРёР№"
    )
    t1_label_0 = Markup(
        "<strong>РџР»РѕС…Рѕ (0)</strong>: РІ СЂР°Р±РѕС‚Рµ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚ Р°СЂРіСѓРјРµРЅС‚Р°С†РёСЏ РїСЂРёРЅСЏС‚С‹С… СЂРµС€РµРЅРёР№"
    )

    review_t1_radio_switcher = RadioField(
        "ReviewT1Form",
        choices=[
            ("5", t1_label_5),
            ("4", t1_label_4),
            ("3", t1_label_3),
            ("2", t1_label_2),
            ("1", t1_label_1),
            ("0", t1_label_0),
        ],
    )

    review_t1_comment = StringField(
        "review_t1_comment", description="Р’Р°С€ РѕС‚РІРµС‚", widget=TextArea()
    )

    t2_label_5 = Markup(
        "<strong>РћС‚Р»РёС‡РЅРѕ (5)</strong>: РІ СЂР°Р±РѕС‚Рµ РїСЂРёРІРµРґРµРЅ РїРѕР»РЅС‹Р№ СЃСЂР°РІРЅРёС‚РµР»СЊРЅС‹Р№ Р°РЅР°Р»РёР· СЃ Р°РЅР°Р»РѕРіР°РјРё"
    )
    t2_label_4 = Markup(
        "<strong>РћС‡РµРЅСЊ С…РѕСЂРѕС€Рѕ (4)</strong>: Р»СѓС‡С€Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј РѕС‚Р»РёС‡РЅРѕ"
    )
    t2_label_3 = Markup(
        "<strong>РҐРѕСЂРѕС€Рѕ (3)</strong>: РІ СЂР°Р±РѕС‚Рµ РїСЂРёРІРµРґРµРЅ РїРѕРґСЂРѕР±РЅС‹Р№ СЃСЂР°РІРЅРёС‚РµР»СЊРЅС‹Р№ Р°РЅР°Р»РёР· СЃ Р°РЅР°Р»РѕРіР°РјРё. РћРґРЅР°РєРѕ РЅРµ РІСЃРµ Р·РЅР°С‡РёРјС‹Рµ Р°РЅР°Р»РѕРіРё РїСЂРёРІРµРґРµРЅС‹ РёР»Рё СЃСЂР°РІРЅРµРЅРёРµ РїСЂРѕРІРѕРґРёР»РѕСЃСЊ РЅРµ РїРѕ РІСЃРµРј Р·РЅР°С‡РёРјС‹Рј РєСЂРёС‚РµСЂРёСЏРј"
    )
    t2_label_2 = Markup(
        "<strong>РЈРґРѕРІР»РµС‚РІРѕСЂРёС‚РµР»СЊРЅРѕ (2)</strong>: Р»СѓС‡С€Рµ, С‡РµРј РґРѕСЃС‚Р°С‚РѕС‡РЅРѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ"
    )
    t2_label_1 = Markup(
        "<strong>Р”РѕСЃС‚Р°С‚РѕС‡РЅРѕ (1)</strong>: РІ СЂР°Р±РѕС‚Рµ РїСЂРёРІРµРґРµРЅС‹ Р°РЅР°Р»РѕРіРё, РЅРѕ РёС… РІС‹Р±РѕСЂ РЅРµРѕР±РѕСЃРЅРѕРІР°РЅ, РїРµСЂРµС‡РµРЅСЊ РЅРµРґРѕСЃС‚Р°С‚РѕС‡РµРЅ, РёР»Рё СЃСЂР°РІРЅРµРЅРёРµ СЃ РЅРёРјРё РЅРёС‡РµРіРѕ РЅРµ РґРµРјРѕРЅСЃС‚СЂРёСЂСѓРµС‚"
    )
    t2_label_0 = Markup(
        "<strong>РџР»РѕС…Рѕ (0)</strong>: РІ СЂР°Р±РѕС‚Рµ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚ Р°СЂРіСѓРјРµРЅС‚Р°С†РёСЏ РїСЂРёРЅСЏС‚С‹С… СЂРµС€РµРЅРёР№"
    )

    review_t2_radio_switcher = RadioField(
        "ReviewT2Form",
        choices=[
            ("5", t2_label_5),
            ("4", t2_label_4),
            ("3", t2_label_3),
            ("2", t2_label_2),
            ("1", t2_label_1),
            ("0", t2_label_0),
        ],
    )

    review_t2_comment = StringField(
        "review_t2_comment", description="Р’Р°С€ РѕС‚РІРµС‚", widget=TextArea()
    )

    p1_label_5 = Markup(
        "<strong>РћС‚Р»РёС‡РЅРѕ (5)</strong>: РєР°С‡РµСЃС‚РІРѕ РєРѕРґР° РЅР° РІС‹СЃРѕРєРѕРј СѓСЂРѕРІРЅРµ СЃ СЃРѕР±Р»СЋРґРµРЅРёРµРј СЂРµРєРѕРјРµРЅРґР°С†РёР№ РїРѕ Р°СЂС…РёС‚РµРєС‚СѓСЂРµ, СЃС‚РёР»СЋ Рё С‚РµСЃС‚РёСЂРѕРІР°РЅРёСЋ РџРћ. РџСЂРѕРґРµРјРѕРЅСЃС‚СЂРёСЂРѕРІР°РЅРЅРѕ РІР»Р°РґРµРЅРёРµ СЃРѕРІСЂРµРјРµРЅРЅС‹РјРё С‚РµС…РЅРѕР»РѕРіРёСЏРјРё Рё Р±РёР±Р»РёРѕС‚РµРєР°РјРё. РўР°РєР¶Рµ РїРѕ РѕС‚РєСЂС‹С‚РѕРјСѓ СЂРµРїРѕР·РёС‚РѕСЂРёСЋ РёСЃС…РѕРґРЅРѕРіРѕ РєРѕРґР° РІРёРґРЅРѕ, С‡С‚Рѕ СЂР°Р±РѕС‚Р° РІРµР»Р°СЃСЊ РІ С‚РµС‡РµРЅРёРµ РІСЃРµРіРѕ РіРѕРґР°"
    )
    p1_label_4 = Markup(
        "<strong>РћС‡РµРЅСЊ С…РѕСЂРѕС€Рѕ (4)</strong>: Р»СѓС‡С€Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј РѕС‚Р»РёС‡РЅРѕ"
    )
    p1_label_3 = Markup(
        "<strong>РҐРѕСЂРѕС€Рѕ (3)</strong>: С…РѕСЂРѕС€РµРµ РєР°С‡РµСЃС‚РІРѕ РєРѕРґР°, РїСЂРѕРґРµРјРѕРЅСЃС‚СЂРёСЂРѕРІР°РЅРѕ РІР»Р°РґРµРЅРёРµ СЃРѕРІСЂРµРјРµРЅРЅС‹РјРё С‚РµС…РЅРѕР»РѕРіРёСЏРјРё Рё Р±РёР±Р»РёРѕС‚РµРєР°РјРё. РР»Рё РїРѕ РѕС‚РєСЂС‹С‚РѕРјСѓ СЂРµРїРѕР·РёС‚РѕСЂРёСЋ РёСЃС…РѕРґРЅРѕРіРѕ РєРѕРґР° РІРёРґРЅРѕ, С‡С‚Рѕ СЂР°Р±РѕС‚Р° РІРµР»Р°СЃСЊ СЃ СЃСѓС‰РµСЃС‚РІРµРЅРЅС‹РјРё РїРµСЂРµСЂС‹РІР°РјРё РёР»Рё С‚РѕР»СЊРєРѕ РІ С‚РµС‡РµРЅРёРµ РѕРґРЅРѕРіРѕ СЃРµРјРµСЃС‚СЂР°"
    )
    p1_label_2 = Markup(
        "<strong>РЈРґРѕРІР»РµС‚РІРѕСЂРёС‚РµР»СЊРЅРѕ (2)</strong>: Р»СѓС‡С€Рµ, С‡РµРј РґРѕСЃС‚Р°С‚РѕС‡РЅРѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ"
    )
    p1_label_1 = Markup(
        "<strong>Р”РѕСЃС‚Р°С‚РѕС‡РЅРѕ (1)</strong>: РїСЂР°РєС‚РёС‡РµСЃРєР°СЏ С‡Р°СЃС‚СЊ РїСЂРёСЃСѓС‚СЃС‚РІСѓРµС‚ Рё СЂР°Р±РѕС‚Р°РµС‚ РёСЃРїСЂР°РІРЅРѕ, РѕРґРЅР°РєРѕ Р°СЂС…РёС‚РµРєС‚СѓСЂР° РЅРµ Р°РґРµРєРІР°С‚РЅР° СЂРµС€Р°РµРјРѕР№ Р·Р°РґР°С‡Рµ Рё СЃС‚РёР»СЊ РёСЃРїРѕР»РЅРµРЅРёСЏ РЅРёР·РєРѕРіРѕ РєР°С‡РµСЃС‚РІР°. РР»Рё РїРѕ РѕС‚РєСЂС‹С‚РѕРјСѓ СЂРµРїРѕР·РёС‚РѕСЂРёСЋ РёСЃС…РѕРґРЅРѕРіРѕ РєРѕРґР° РІРёРґРЅРѕ, С‡С‚Рѕ СЂР°Р±РѕС‚Р° РІРµР»Р°СЃСЊ С‚РѕР»СЊРєРѕ РІ РїРѕСЃР»РµРґРЅРёР№ РјРµСЃСЏС† РїРµСЂРµРґ РґР°С‚РѕР№ Р·Р°С‡С‘С‚Р°"
    )
    p1_label_0 = Markup(
        "<strong>РџР»РѕС…Рѕ (0)</strong>: РїСЂР°РєС‚РёС‡РµСЃРєР°СЏ С‡Р°СЃС‚СЊ РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚ РёР»Рё РµРµ РЅР°Р»РёС‡РёРµ РЅРµ РїРѕР·РІРѕР»СЏРµС‚ СЃРґРµР»Р°С‚СЊ РІС‹РІРѕРґС‹ Рѕ С‚РµС…РЅРёС‡РµСЃРєРѕРј СѓСЂРѕРІРЅРµ Р°РІС‚РѕСЂР°. РћС‚РєСЂС‹С‚С‹Р№ СЂРµРїРѕР·РёС‚РѕСЂРёР№ РёСЃС…РѕРґРЅРѕРіРѕ РєРѕРґР° РЅРµ РїСЂРµРґРѕСЃС‚Р°РІР»РµРЅ"
    )
    p1_label_x = Markup(
        "<strong>РќРµ РїСЂРёРјРµРЅРёРјРѕ</strong>: РёСЃС…РѕРґРЅС‹Р№ РєРѕРґ Р·Р°РєСЂС‹С‚ РёР»Рё СЂР°Р±РѕС‚Р° РЅРµ РїСЂРµРґРїРѕР»Р°РіР°РµС‚ РЅР°РїРёСЃР°РЅРёСЏ РєРѕРґР°"
    )

    review_p1_radio_switcher = RadioField(
        "ReviewP1Form",
        choices=[
            ("5", p1_label_5),
            ("4", p1_label_4),
            ("3", p1_label_3),
            ("2", p1_label_2),
            ("1", p1_label_1),
            ("0", p1_label_0),
            ("x", p1_label_x),
        ],
    )

    review_p1_comment = StringField(
        "review_p1_comment", description="Р’Р°С€ РѕС‚РІРµС‚", widget=TextArea()
    )

    p2_label_5 = Markup(
        "<strong>РћС‚Р»РёС‡РЅРѕ (5)</strong>: СЌРєСЃРїРµСЂРёРјРµРЅС‚Р°Р»СЊРЅР°СЏ РјРµС‚РѕРґРѕР»РѕРіРёСЏ РїРѕР»РЅРѕСЃС‚СЊСЋ РѕРїРёСЃР°РЅР°, СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓРµС‚ РїСЂРёРЅСЏС‚С‹Рј РІ РґР°РЅРЅРѕР№ РѕР±Р»Р°СЃС‚Рё СЃС‚Р°РЅРґР°СЂС‚Р°Рј, Рё СЃР°РјР° РїРѕ СЃРµР±Рµ РЅРµ РІС‹Р·С‹РІР°РµС‚ РІРѕРїСЂРѕСЃРѕРІ, РЅРµРїРѕСЃСЂРµРґСЃС‚РІРµРЅРЅС‹Рµ СЂРµР·СѓР»СЊС‚Р°С‚С‹ Р·Р°РґРѕРєСѓРјРµРЅС‚РёСЂРѕРІР°РЅС‹ Рё РґРѕСЃС‚СѓРїРЅС‹, РѕР±СЂР°Р±РѕС‚РєР° СЂРµР·СѓР»СЊС‚Р°С‚РѕРІ РјРµС‚РѕРґРѕР»РѕРіРёС‡РµСЃРєРё РєРѕСЂСЂРµРєС‚РЅР°"
    )
    p2_label_4 = Markup(
        "<strong>РћС‡РµРЅСЊ С…РѕСЂРѕС€Рѕ (4)</strong>: Р»СѓС‡С€Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј РѕС‚Р»РёС‡РЅРѕ"
    )
    p2_label_3 = Markup(
        "<strong>РҐРѕСЂРѕС€Рѕ (3)</strong>: СЌРєСЃРїРµСЂРёРјРµРЅС‚Р°Р»СЊРЅР°СЏ РјРµС‚РѕРґРѕР»РѕРіРёСЏ РїСЂРѕСЂР°Р±РѕС‚Р°РЅР° РЅРµРґРѕСЃС‚Р°С‚РѕС‡РЅРѕ С…РѕСЂРѕС€Рѕ, РѕРґРЅР°РєРѕ РѕР±С‰РµРµ РЅР°РїСЂР°РІР»РµРЅРёРµ СЌРєСЃРїРµСЂРёРјРµРЅС‚РѕРІ Р°РґРµРєРІР°С‚РЅРѕ РїРѕСЃС‚Р°РІР»РµРЅРЅРѕР№ Р·Р°РґР°С‡Рµ. РћР±СЂР°Р±РѕС‚РєР° РґР°РЅРЅС‹С… СЃРѕРґРµСЂР¶РёС‚ РѕС€РёР±РєРё, РЅРµ СЃС‚Р°РІСЏС‰РёРµ, РѕРґРЅР°РєРѕ, РїРѕРґ СЃРѕРјРЅРµРЅРёРµ РѕР±С‰РёР№ СЂРµР·СѓР»СЊС‚Р°С‚. РЈРєР°Р·Р°РЅС‹ С‚РѕР»СЊРєРѕ РёС‚РѕРіРѕРІС‹Рµ РґР°РЅРЅС‹Рµ СЌРєСЃРїРµСЂРёРјРµРЅС‚РѕРІ"
    )
    p2_label_2 = Markup(
        "<strong>РЈРґРѕРІР»РµС‚РІРѕСЂРёС‚РµР»СЊРЅРѕ (2)</strong>: Р»СѓС‡С€Рµ, С‡РµРј РґРѕСЃС‚Р°С‚РѕС‡РЅРѕ, РЅРѕ С…СѓР¶Рµ, С‡РµРј С…РѕСЂРѕС€Рѕ"
    )
    p2_label_1 = Markup(
        "<strong>Р”РѕСЃС‚Р°С‚РѕС‡РЅРѕ (1)</strong>: СЌРєСЃРїРµСЂРёРјРµРЅС‚С‹ РІС‹РїРѕР»РЅРµРЅС‹, Р° СЂРµР·СѓР»СЊС‚Р°С‚С‹ РѕР±СЂР°Р±РѕС‚Р°РЅС‹ Р±РµР· РѕРїРѕСЂС‹ РЅР° РєР°С‡РµСЃС‚РІРµРЅРЅСѓСЋ СЌРєСЃРїРµСЂРёРјРµРЅС‚Р°Р»СЊРЅСѓСЋ РјРµС‚РѕРґРѕР»РѕРіРёСЋ, РёР»Рё РІ С…РѕРґРµ СЂР°Р±РѕС‚С‹ Р±С‹Р»Рё РґРѕРїСѓС‰РµРЅС‹ СЃСѓС‰РµСЃС‚РІРµРЅРЅС‹Рµ РѕС€РёР±РєРё, СЃС‚Р°РІСЏС‰РёРµ СЂРµР·СѓР»СЊС‚Р°С‚С‹ РїРѕРґ СЃРѕРјРЅРµРЅРёРµ. РС‚РѕРіРѕРІС‹Рµ РґР°РЅРЅС‹Рµ РїСЂРµРґРѕСЃС‚Р°РІР»РµРЅС‹ РЅРµ РїРѕР»РЅРѕСЃС‚СЊСЋ"
    )
    p2_label_0 = Markup(
        "<strong>РџР»РѕС…Рѕ (0)</strong>: СЌРєСЃРїРµСЂРёРјРµРЅС‚РѕРІ Рё/РёР»Рё РёР·РјРµСЂРµРЅРёР№ РЅРµС‚, РёР»Рё РѕРЅРё СЃРѕРґРµСЂР¶Р°С‚ СЃРµСЂСЊС‘Р·РЅС‹Рµ РѕС€РёР±РєРё РёР»Рё РёСЃРєР°Р¶РµРЅРёСЏ"
    )
    p2_label_x = Markup(
        "<strong>РќРµ РїСЂРёРјРµРЅРёРјРѕ</strong>: СЂР°Р±РѕС‚Р° РЅРµ РїСЂРµРґРїРѕР»Р°РіР°РµС‚ СЌРєСЃРїРµСЂРёРјРµРЅС‚РѕРІ РёР»Рё РёР·РјРµСЂРµРЅРёР№"
    )

    review_p2_radio_switcher = RadioField(
        "ReviewP2Form",
        choices=[
            ("5", p2_label_5),
            ("4", p2_label_4),
            ("3", p2_label_3),
            ("2", p2_label_2),
            ("1", p2_label_1),
            ("0", p2_label_0),
            ("x", p2_label_x),
        ],
    )

    review_p2_comment = StringField(
        "review_p2_comment", description="Р’Р°С€ РѕС‚РІРµС‚", widget=TextArea()
    )

    review_overall_comment = StringField(
        "review_overall_comment", description="Р’Р°С€ РѕС‚РІРµС‚", widget=TextArea()
    )

    verdict_label_1 = Markup("<strong>РњРѕР¶РЅРѕ Р·Р°С‡РµСЃС‚СЊ</strong>")
    verdict_label_0 = Markup("<strong>РќР° РґРѕСЂР°Р±РѕС‚РєСѓ</strong>")

    review_verdict_radio_switcher = RadioField(
        "ReviewVerdictForm", choices=[("1", verdict_label_1), ("0", verdict_label_0)]
    )

    review_file = FileField()
